src/Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДниНедели/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Возвращает порядковый номер дня по перечислению.
//
Функция НомерДняПоЗначению(ДеньНедели) Экспорт
	
	Результат = 0;
	
	Если ДеньНедели = Перечисления.ДниНедели.Понедельник Тогда
		Результат = 1;
	ИначеЕсли ДеньНедели = Перечисления.ДниНедели.Вторник Тогда
		Результат = 2;
	ИначеЕсли ДеньНедели = Перечисления.ДниНедели.Среда Тогда
		Результат = 3;
	ИначеЕсли ДеньНедели = Перечисления.ДниНедели.Четверг Тогда
		Результат = 4;
	ИначеЕсли ДеньНедели = Перечисления.ДниНедели.Пятница Тогда
		Результат = 5;
	ИначеЕсли ДеньНедели = Перечисления.ДниНедели.Суббота Тогда
		Результат = 6;
	ИначеЕсли ДеньНедели = Перечисления.ДниНедели.Воскресенье Тогда
		Результат = 7;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
